Revit 2024 API
BuiltInFailures.PartMakerMethodForWallFailures Class
 Failures related to parts related to walls.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class PartMakerMethodForWallFailures
Visual Basic
Public NotInheritable Class PartMakerMethodForWallFailures
Visual C++
public ref class PartMakerMethodForWallFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForWallFailures
See Also
BuiltInFailures.PartMakerMethodForWallFailures Members
Autodesk.Revit.DB Namespace